Tekla.Structures.Dialog.DynamicTypeBuilder
Creates dynamic assemblies.

Tekla.Structures.Dialog.DynamicTypeBuilder.BuildType(System.String,System.String,Tekla.Structures.Dialog.BuildTag[])
Creates a dynamic assembly.
location: The path to the dynamic assembly.
name: The name of the dynamic assembly.
tags: A description of the type members. Each tag defines name and type of the generated property.
Returns: An instance of the dynamic assembly.

Tekla.Structures.Dialog.DynamicTypeBuilder.BuildTypeFromInterface(System.String,System.String,System.Type)
Creates a dynamic assembly which implements the given interface.
location: The path to the dynamic assembly.
name: The name of the dynamic assembly.
interfaceType: A description of the type members. The interface defines name and type of the generated property.
Returns: An type which implements the supplied interface.